ABiondi12/project_sgn/Old_work/valdambrini_cheli_papallo_tarmati/BIPE MATLAB/IOC/ICARO3_Onda_bipe/Src/stm32f4_custom_USART.c
#include "stm32f4_custom_USART.h"

// DRIVER FOR USART 2,3,4,5 


//
//  SELECT PINs and BAUD rate
//

//USART 2
#define USART2_BAUD_RATE 115200
// 9600 è per il sensore ad ultrasuoni. Per il GPS ublox settare il baud a115200
#define USART2_ON_PA2_PA3
//#define USART2_ON_PD5_PD6


//USART 3
#define USART3_BAUD_RATE 115200
#define USART3_ON_PC10_PC11
//#define USART3_ON_PD8_PD9


//USART 4
#define USART4_BAUD_RATE 57600      //For Aerocom AC4868 57600
//#define USART4_ON_PC10_PC11
#define USART4_ON_PA0_PA1

//USART 5 (ONLY ONE PIN PACK FOR THIS)
#define USART5_BAUD_RATE 115200
#define USART5_ON_PC12_PD2


#define USART_BUFFER_DIM 256


//buffers for USART 2 
static CircularBuffer USART2_RX_CB;
static uint8_t USART2_RX_BUFF[USART_BUFFER_DIM];
static CircularBuffer USART2_TX_CB;
static uint8_t USART2_TX_BUFF[USART_BUFFER_DIM];
//buffers for USART 3 
static CircularBuffer USART3_RX_CB;
static uint8_t USART3_RX_BUFF[USART_BUFFER_DIM];
static CircularBuffer USART3_TX_CB;
static uint8_t USART3_TX_BUFF[USART_BUFFER_DIM];
//buffers for USART 4 
static CircularBuffer USART4_RX_CB;
static uint8_t USART4_RX_BUFF[USART_BUFFER_DIM];
static CircularBuffer USART4_TX_CB;
static uint8_t USART4_TX_BUFF[USART_BUFFER_DIM];
//buffers for USART 5
static CircularBuffer USART5_RX_CB;
static uint8_t USART5_RX_BUFF[USART_BUFFER_DIM];
static CircularBuffer USART5_TX_CB;
static uint8_t USART5_TX_BUFF[USART_BUFFER_DIM];

/* NEW: */
UART_HandleTypeDef 			Uart2Handle; //note uart 4 and 5 are UART type, while the others (1,2,3,6) are USART type
UART_HandleTypeDef 			Uart3Handle;
UART_HandleTypeDef 			Uart4Handle;		
UART_HandleTypeDef 			Uart5Handle;


//counters for ORE events
//	ORE_count[N] is for USART_N
unsigned int ORE_count[7] = {0, 0, 0, 0, 0, 0, 0};  



void SetLed(uint32_t pin, uint32_t mode){
	
	GPIO_InitTypeDef       GPIO_InitStructure;
	
	GPIO_InitStructure.Pin = pin;
	GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP; 
    GPIO_InitStructure.Speed = GPIO_SPEED_FAST;
    GPIO_InitStructure.Pull  = GPIO_PULLUP;
    HAL_GPIO_Init(GPIOD, &GPIO_InitStructure);
	
	if(mode == 1)
		HAL_GPIO_WritePin(GPIOD,pin,GPIO_PIN_SET);
	else
		HAL_GPIO_TogglePin(GPIOD,pin);
} 

/** 
  * @brief  USART2 interrupt handler.
  * @note   Use USART_GetITStatus to check what event generated the interrupt.
  * @retval None.
  */
 
  
void USART2_IRQHandler()
{		
		
  uint32_t tmp1 = 0, tmp2 = 0;
  
  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_PE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_PE);
  /* USART parity error interrupt occurred -----------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_PEFLAG(&Uart2Handle);
    Uart2Handle.ErrorCode |= HAL_USART_ERROR_PE;
  }

  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_FE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_ERR);
  /* USART frame error interrupt occurred ------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_FEFLAG(&Uart2Handle);
    Uart2Handle.ErrorCode |= HAL_USART_ERROR_FE;
  }

  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_NE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_ERR);
  /* USART noise error interrupt occurred ------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_NEFLAG(&Uart2Handle);
    Uart2Handle.ErrorCode |= HAL_USART_ERROR_NE;
  }

  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_ORE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, UART_IT_RXNE); // it was USART_IT_ERR);
  /* USART Over-Run interrupt occurred ---------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_OREFLAG(&Uart2Handle);
		ORE_count[2]++; //use index 2 for USART2
    Uart2Handle.ErrorCode |= HAL_USART_ERROR_ORE;
  }

  if(Uart2Handle.ErrorCode != HAL_USART_ERROR_NONE)
  {
    /* Set the USART state ready to be able to start again the process */
    Uart2Handle.State = HAL_UART_STATE_READY;
    
    //do not call callback
		//HAL_USART_ErrorCallback(&Uart2Handle);
  }

//  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_RXNE);
//  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_RXNE);
//  /* USART in mode Receiver --------------------------------------------------*/
//  if((tmp1 != RESET) && (tmp2 != RESET))
//  {
//    if(&Uart2Handle->State == HAL_USART_STATE_BUSY_RX)
//    {
//      USART_Receive_IT(&Uart2Handle);
//    }
//    else
//    {
//      USART_TransmitReceive_IT(&Uart2Handle);
//    }
//  }

//  tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_TXE);
//  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_TXE);
//  /* USART in mode Transmitter -----------------------------------------------*/
//  if((tmp1 != RESET) && (tmp2 != RESET))
//  {
//    if(&Uart2Handle->State == HAL_USART_STATE_BUSY_TX)
//    {
//      USART_Transmit_IT(&Uart2Handle);
//    }
//    else
//    {
//      USART_TransmitReceive_IT(&Uart2Handle);
//    }
//  }

 
	
		/* UART1 in mode Receiver ---------------------------------------------------*/
		tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, UART_FLAG_RXNE);
		tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, UART_IT_RXNE);
        //OLD: if(USART_GetITStatus(USART2, USART_IT_RXNE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET))		{
				// RX interrupt: new data received from USART
        CircularBuffer_Write(&USART2_RX_CB, Uart2Handle.Instance->DR); //OLD: USART2->DR);
		}
		
		/* UART1 in mode Transmitter ------------------------------------------------*/
		tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, UART_FLAG_TXE);
		tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, UART_IT_TXE);
		//OLD: if(USART_GetITStatus(USART2, USART_IT_TXE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET)){
			// TX interrupt: data correctly transmitted 
			uint8_t item;
      /* Check if there are data to be transmitted, otherwise disable
       * TX interrupts */
      if(CircularBuffer_Read(&USART2_TX_CB, &item))
            Uart2Handle.Instance->DR = item; //OLD. USART2->DR = item;
      else
			// TX buffer is empty => Disable the UART Transmit data register empty Interrupt
			__HAL_USART_DISABLE_IT(&Uart2Handle, UART_IT_TXE);
					
