ABiondi12/project_sgn/Old_work/valdambrini_cheli_papallo_tarmati/BIPE MATLAB/IOC/ICARO3_Onda_bipe/Src/stm32f4_custom_USART.c
    }
	
		
		
//		 tmp1 = __HAL_USART_GET_FLAG(&Uart2Handle, USART_FLAG_TC);
//  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart2Handle, USART_IT_TC);
//  /* USART in mode Transmitter (transmission end) ----------------------------*/
//  if((tmp1 != RESET) && (tmp2 != RESET))
//  {
//    USART_EndTransmit_IT(&Uart2Handle);
//  }

}

/** 
  * @brief  USART3 interrupt handler.
  * @note   Use USART_GetITStatus to check what event generated the interrupt.
  * @retval None.
  */
void USART3_IRQHandler()
{
		
  uint32_t tmp1 = 0, tmp2 = 0;
  
  tmp1 = __HAL_USART_GET_FLAG(&Uart3Handle, USART_FLAG_ORE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart3Handle, UART_IT_RXNE); // it was USART_IT_ERR);
  /* USART Over-Run interrupt occurred ---------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_OREFLAG(&Uart3Handle);
		ORE_count[3]++; //use index 3 for USART2
    Uart3Handle.ErrorCode |= HAL_USART_ERROR_ORE;
  }

  if(Uart3Handle.ErrorCode != HAL_USART_ERROR_NONE)
  {
    /* Set the USART state ready to be able to start again the process */
    Uart3Handle.State = HAL_UART_STATE_READY;
    
    //do not call callback
		//HAL_USART_ErrorCallback(&Uart2Handle);
  }

	
		/* UART1 in mode Receiver ---------------------------------------------------*/
		tmp1 = __HAL_UART_GET_FLAG(&Uart3Handle, UART_FLAG_RXNE);
		tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart3Handle, UART_IT_RXNE);
        //OLD: if(UART_GetITStatus(UART2, UART_IT_RXNE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET))		{
				// RX interrupt: new data received from UART
        CircularBuffer_Write(&USART3_RX_CB, Uart3Handle.Instance->DR); //OLD: UART2->DR);
		}
		
		/* UART1 in mode Transmitter ------------------------------------------------*/
		tmp1 = __HAL_UART_GET_FLAG(&Uart3Handle, UART_FLAG_TXE);
		tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart3Handle, UART_IT_TXE);
		//OLD: if(UART_GetITStatus(UART2, UART_IT_TXE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET)){
			// TX interrupt: data correctly transmitted 
			uint8_t item;
      /* Check if there are data to be transmitted, otherwise disable
       * TX interrupts */
      if(CircularBuffer_Read(&USART3_TX_CB, &item))
            Uart3Handle.Instance->DR = item; //OLD. UART2->DR = item;
      else
			// TX buffer is empty => Disable the UART Transmit data register empty Interrupt
			__HAL_UART_DISABLE_IT(&Uart3Handle, UART_IT_TXE);
					
    }
	
		
//	------------- vecchio
//	
//		/* UART1 in mode Receiver ---------------------------------------------------*/
//		uint32_t tmp1 = __HAL_UART_GET_FLAG(&Uart3Handle, UART_FLAG_RXNE);
//		uint32_t tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart3Handle, UART_IT_RXNE);
//        //OLD: if(USART_GetITStatus(USART3, USART_IT_RXNE) != RESET)
//		if((tmp1 != RESET) && (tmp2 != RESET))		{
//				// RX interrupt: new data received from USART
//        CircularBuffer_Write(&USART3_RX_CB, Uart3Handle.Instance->DR); //OLD: USART3->DR);
//		}
//		
//		/* UART1 in mode Transmitter ------------------------------------------------*/
//		tmp1 = __HAL_UART_GET_FLAG(&Uart3Handle, UART_FLAG_TXE);
//		tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart3Handle, UART_IT_TXE);
//		//OLD: if(USART_GetITStatus(USART2, USART_IT_TXE) != RESET)
//		if((tmp1 != RESET) && (tmp2 != RESET)){
//			// TX interrupt: data correctly transmitted 
//			uint8_t item;
//      /* Check if there are data to be transmitted, otherwise disable
//       * TX interrupts */
//      if(CircularBuffer_Read(&USART3_TX_CB, &item))
//            Uart3Handle.Instance->DR = item; //OLD. USART3->DR = item;
//      else
//					// TX buffer is empty => Disable the UART Transmit data register empty Interrupt
//					__HAL_UART_DISABLE_IT(&Uart3Handle, UART_IT_TXE);
//    }
}

/** 
  * @brief  USART4 interrupt handler.
  * @note   Use USART_GetITStatus to check what event generated the interrupt.
  * @retval None.
  */

void UART4_IRQHandler()
{
  uint32_t tmp1 = 0, tmp2 = 0;
  
  tmp1 = __HAL_USART_GET_FLAG(&Uart4Handle, USART_FLAG_ORE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart4Handle, UART_IT_RXNE); // it was USART_IT_ERR);
  /* USART Over-Run interrupt occurred ---------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_OREFLAG(&Uart4Handle);
		ORE_count[4]++; //use index 4 for USART4
    Uart4Handle.ErrorCode |= HAL_USART_ERROR_ORE;
  }

  if(Uart4Handle.ErrorCode != HAL_USART_ERROR_NONE)
  {
    /* Set the USART state ready to be able to start again the process */
    Uart4Handle.State = HAL_UART_STATE_READY;
    
    //do not call callback
		//HAL_USART_ErrorCallback(&Uart2Handle);
  }


		tmp1 = __HAL_UART_GET_FLAG(&Uart4Handle, UART_FLAG_RXNE);
		tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart4Handle, UART_IT_RXNE);
        //OLD: if(USART_GetITStatus(USART4, USART_IT_RXNE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET))		{
				// RX interrupt: new data received from USART
        CircularBuffer_Write(&USART4_RX_CB, Uart4Handle.Instance->DR); //OLD: USART2->DR);
		}
		
		// UART1 in mode Transmitter ------------------------------------------------
		tmp1 = __HAL_UART_GET_FLAG(&Uart4Handle, UART_FLAG_TXE);
		tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart4Handle, UART_IT_TXE);
		//OLD: if(USART_GetITStatus(USART4, USART_IT_TXE) != RESET)
		if((tmp1 != RESET) && (tmp2 != RESET)){
			// TX interrupt: data correctly transmitted 
			uint8_t item;
      // Check if there are data to be transmitted, otherwise disable
       // TX interrupts 
      if(CircularBuffer_Read(&USART4_TX_CB, &item))
            Uart4Handle.Instance->DR = item; //OLD. USART4->DR = item;
      else
					// TX buffer is empty => Diable the UART Transmit data register empty Interrupt
					__HAL_UART_DISABLE_IT(&Uart4Handle, UART_IT_TXE);
    }
}

/** 
  * @brief  USART4 interrupt handler.
  * @note   Use USART_GetITStatus to check what event generated the interrupt.
  * @retval None.
  */

void UART5_IRQHandler()
{
  uint32_t tmp1 = 0, tmp2 = 0;
  
  tmp1 = __HAL_USART_GET_FLAG(&Uart5Handle, USART_FLAG_ORE);
  tmp2 = __HAL_USART_GET_IT_SOURCE(&Uart5Handle, UART_IT_RXNE); // it was USART_IT_ERR);
  /* USART Over-Run interrupt occurred ---------------------------------------*/
  if((tmp1 != RESET) && (tmp2 != RESET))
  {
    __HAL_USART_CLEAR_OREFLAG(&Uart5Handle);
		ORE_count[5]++; //use index 4 for USART4
    Uart5Handle.ErrorCode |= HAL_USART_ERROR_ORE;
  }

  if(Uart5Handle.ErrorCode != HAL_USART_ERROR_NONE)
  {
    /* Set the USART state ready to be able to start again the process */
    Uart5Handle.State = HAL_UART_STATE_READY;
    
    //do not call callback
		//HAL_USART_ErrorCallback(&Uart2Handle);
  }
    // UART1 in mode Receiver ---------------------------------------------------
    tmp1 = __HAL_UART_GET_FLAG(&Uart5Handle, UART_FLAG_RXNE);
    tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart5Handle, UART_IT_RXNE);
        //OLD: if(USART_GetITStatus(USART4, USART_IT_RXNE) != RESET)
    if((tmp1 != RESET) && (tmp2 != RESET))    {
        // RX interrupt: new data received from USART
        CircularBuffer_Write(&USART5_RX_CB, Uart5Handle.Instance->DR); //OLD: USART2->DR);
    }
    
