ABiondi12/project_sgn/Old_work/valdambrini_cheli_papallo_tarmati/BIPE MATLAB/IOC/ICARO3_Onda_bipe/Src/stm32f4_custom_USART.c
    // UART1 in mode Transmitter ------------------------------------------------
    tmp1 = __HAL_UART_GET_FLAG(&Uart5Handle, UART_FLAG_TXE);
    tmp2 = __HAL_UART_GET_IT_SOURCE(&Uart5Handle, UART_IT_TXE);
    //OLD: if(USART_GetITStatus(USART4, USART_IT_TXE) != RESET)
    if((tmp1 != RESET) && (tmp2 != RESET)){
      // TX interrupt: data correctly transmitted 
      uint8_t item;
      // Check if there are data to be transmitted, otherwise disable
       // TX interrupts 
      if(CircularBuffer_Read(&USART5_TX_CB, &item))
            Uart5Handle.Instance->DR = item; //OLD. USART4->DR = item;
      else
          // TX buffer is empty => Diable the UART Transmit data register empty Interrupt
          __HAL_UART_DISABLE_IT(&Uart5Handle, UART_IT_TXE);
    }
}



/* USARTx INITIALIZATION:                       *
*************************************************/

  /** @brief  USART2 initialization function.
  * @note   Peripheral initialization is performed by ST block. Here RX and
  *         TX CircularBuffer are initialized, and USART interrupt are enabled.
  * @retval None.
  */  

void USART2_Init()
{
	
    // Struct for GPIO and USART initialization
    GPIO_InitTypeDef 		GPIO_InitStruct;
    //USART_InitTypeDef 		USART_InitStruct;
	/*
    USART_ClockInitTypeDef 	USART_ClockInitStruct;
    NVIC_InitTypeDef 		NVIC_InitStruct; 
	*/

#ifdef USART2_ON_PA2_PA3
    // Enable GPIOA clock
	__GPIOA_CLK_ENABLE();
	__USART2_CLK_ENABLE();
	
    // Set USART TX pin (PA2)
    GPIO_InitStruct.Pin 		= GPIO_PIN_2;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
    GPIO_InitStruct.Alternate 	= GPIO_AF7_USART2;
	
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	// Set USART RX in (PA3) with Pull-Up resistence on
    GPIO_InitStruct.Pin 		= GPIO_PIN_3;
    GPIO_InitStruct.Pull		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	
	
	
#endif
#ifdef USART2_ON_PD5_PD6
	// Enable GPIOD clock
	__GPIOA_CLK_ENABLE();
	__USART2_CLK_ENABLE();
	
    // Set USART TX pin (PD5)
    GPIO_InitStruct.Pin 		= GPIO_PIN_5;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
	GPIO_InitStruct.Alternate 	= GPIO_AF7_USART2;
	
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
	
    // Set USART RX in (PD6) with Pull-Up resistence on
    GPIO_InitStruct.Pin			= GPIO_PIN_6;
    GPIO_InitStruct.Pull 		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct); 
	
	

	
#endif
    
    // USART clock enable
	__USART2_CLK_ENABLE();
  
	// Configure peripheral
	Uart2Handle.Instance		= USART2;
	Uart2Handle.Init.BaudRate	= USART2_BAUD_RATE;
	Uart2Handle.Init.WordLength = UART_WORDLENGTH_8B;
	Uart2Handle.Init.StopBits	= UART_STOPBITS_1;
	Uart2Handle.Init.Parity		= UART_PARITY_NONE;
	Uart2Handle.Init.HwFlowCtl	= UART_HWCONTROL_NONE;
	Uart2Handle.Init.Mode		= UART_MODE_TX_RX;
	
	//USART internal clock?
	
    // RX and TX CircularBuffer initialization
    CircularBuffer_Init(&USART2_TX_CB, USART2_TX_BUFF, USART_BUFFER_DIM);
    CircularBuffer_Init(&USART2_RX_CB, USART2_RX_BUFF, USART_BUFFER_DIM);
    
    // Enable USART2 RX interrupt
    HAL_NVIC_SetPriority(USART2_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(USART2_IRQn);
	
	//Enable the UART Transmit data register empty Interrupt
	//	=> as soon as a byte is received the IRQ handler is called. 
	//	DO NOT enable here the TXE interrupt, it will be enabled whne data is sent 
	//	and automatically disabled when data to be sent is finished (buffer empty)
    __HAL_UART_ENABLE_IT(&Uart2Handle, UART_IT_RXNE);
	
    /* Enable USART */
    //OLD: USART_Cmd(USART2, ENABLE);
		if(HAL_UART_Init(&Uart2Handle) != HAL_OK)
		{
			Error_Handler();
		}
}

/** 
  * @brief  USART3 initialization function.
  * @note   Peripheral initialization is performed by ST block. Here RX and
  *          TX CircularBuffer are initialized, and USART interrupt are enabled.
  * @retval None.
  */
void USART3_Init()
{   
    // Struct for GPIO and USART initialization
    GPIO_InitTypeDef 		GPIO_InitStruct;
    //USART_InitTypeDef 		USART_InitStruct;
	/*
    USART_ClockInitTypeDef 	USART_ClockInitStruct;
    NVIC_InitTypeDef 		NVIC_InitStruct;
	*/

#ifdef USART3_ON_PC10_PC11
    // Enable GPIOC clock
	__GPIOC_CLK_ENABLE();
	__USART3_CLK_ENABLE();
	
    // Set USART TX pin (PC10)
    GPIO_InitStruct.Pin 		= GPIO_PIN_10;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
	GPIO_InitStruct.Alternate 	= GPIO_AF7_USART3;
	
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
    // Set USART RX in (PC11) with Pull-Up resistance on
    GPIO_InitStruct.Pin 		= GPIO_PIN_11;
    GPIO_InitStruct.Pull		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

#endif
#ifdef USART3_ON_PD8_PD9
    // Enable GPIOD clock
	__GPIOD_CLK_ENABLE();
	__USART3_CLK_ENABLE();
	
    // Set USART TX pin (PD8)
    GPIO_InitStruct.Pin 		= GPIO_PIN_8;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
	GPIO_InitStruct.Alternate 	= GPIO_AF7_USART3;
	
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);
	
    // Set USART RX in (PD9) with Pull-Up resistence on
    GPIO_InitStruct.Pin 		= GPIO_PIN_9;
    GPIO_InitStruct.Pull		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

#endif    
    
    // USART clock enable
	__USART3_CLK_ENABLE(); // ???????
      
	// Configure peripheral
	Uart3Handle.Instance		= USART3;
	Uart3Handle.Init.BaudRate	= USART3_BAUD_RATE;
	Uart3Handle.Init.WordLength = UART_WORDLENGTH_8B;
	Uart3Handle.Init.StopBits	= UART_STOPBITS_1;
	Uart3Handle.Init.Parity		= UART_PARITY_NONE;
	Uart3Handle.Init.HwFlowCtl	= UART_HWCONTROL_NONE;
	Uart3Handle.Init.Mode		= UART_MODE_TX_RX;
    
    // RX and TX CircularBuffer initialization
    CircularBuffer_Init(&USART3_TX_CB, USART3_TX_BUFF, USART_BUFFER_DIM);
    CircularBuffer_Init(&USART3_RX_CB, USART3_RX_BUFF, USART_BUFFER_DIM);
    
    // Enable USART3 RX interrupt
    HAL_NVIC_SetPriority(USART3_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(USART3_IRQn);
	
	//Enable the UART Transmit data register empty Interrupt
	//	=> as soon as a byte is received the IRQ handler is called.
	//	DO NOT enable here the TXE interrupt, it will be enabled whne data is sent 
	//	and automatically disabled when data to be sent is finished (buffer empty)
    __HAL_UART_ENABLE_IT(&Uart3Handle, UART_IT_RXNE);
	
    // Enable USART
    //OLD: USART_Cmd(USART3, ENABLE);
		if(HAL_UART_Init(&Uart3Handle) != HAL_OK)
		{
			Error_Handler();
		}
		
