ABiondi12/project_sgn/Old_work/valdambrini_cheli_papallo_tarmati/BIPE MATLAB/IOC/ICARO3_Onda_bipe/Src/stm32f4_custom_USART.c
}

/** 
  * @brief  USART4 initialization function.
  * @note   Peripheral initialization is performed by ST block. Here RX and
  *          TX CircularBuffer are initialized, and USART interrupt are enabled.
  * @retval None.
  */
  

void USART4_Init()
{
    // Struct for GPIO and USART initialization
    GPIO_InitTypeDef GPIO_InitStruct;
    //USART_InitTypeDef USART_InitStruct;
	
    // USART_ClockInitTypeDef USART_ClockInitStruct;
    // NVIC_InitTypeDef NVIC_InitStruct;
	
  
#ifdef USART4_ON_PA0_PA1
    // Enable GPIOA clock
	__GPIOA_CLK_ENABLE();
	__UART4_CLK_ENABLE();
	
    // Set USART TX pin (PA0)
    GPIO_InitStruct.Pin 		= GPIO_PIN_0;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
	GPIO_InitStruct.Alternate 	= GPIO_AF8_UART4;
	
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);
	
    // Set USART RX in (PA1) with Pull-Up resistence on
    GPIO_InitStruct.Pin 		= GPIO_PIN_1;
    GPIO_InitStruct.Pull		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

#endif
#ifdef USART4_ON_PC10_PC11
    // Enable GPIOC clock
	__GPIOC_CLK_ENABLE();
	__UART4_CLK_ENABLE();
	
    // Set USART TX pin (PA0)
    GPIO_InitStruct.Pin 		= GPIO_PIN_10;
    GPIO_InitStruct.Mode 		= GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed 		= GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull 		= GPIO_NOPULL;
	GPIO_InitStruct.Alternate 	= GPIO_AF8_UART4;
	
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
	
    // Set USART RX in (PC11) with Pull-Up resistence on
    GPIO_InitStruct.Pin 		= GPIO_PIN_11;
    GPIO_InitStruct.Pull		= GPIO_PULLUP;
	
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

#endif  
    
    // USART clock enable
	__UART4_CLK_ENABLE();
  
	// Configure peripheral
	Uart4Handle.Instance		= UART4;
	Uart4Handle.Init.BaudRate	= USART4_BAUD_RATE;
	Uart4Handle.Init.WordLength = UART_WORDLENGTH_8B;
	Uart4Handle.Init.StopBits	= UART_STOPBITS_1;
	Uart4Handle.Init.Parity		= UART_PARITY_NONE;
	Uart4Handle.Init.HwFlowCtl	= UART_HWCONTROL_NONE;
	Uart4Handle.Init.Mode		= UART_MODE_TX_RX;
    
    // RX and TX CircularBuffer initialization 
    CircularBuffer_Init(&USART4_TX_CB, USART4_TX_BUFF, USART_BUFFER_DIM);
    CircularBuffer_Init(&USART4_RX_CB, USART4_RX_BUFF, USART_BUFFER_DIM);
    
    // Enable USART3 RX interrupt
    HAL_NVIC_SetPriority(UART4_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(UART4_IRQn);
	
	//Enable the UART Transmit data register empty Interrupt
	//	=> as soon as a byte is received the IRQ handler is called.
	//	DO NOT enable here the TXE interrupt, it will be enabled whne data is sent 
	//	and automatically disabled when data to be sent is finished (buffer empty)
    __HAL_UART_ENABLE_IT(&Uart4Handle, UART_IT_RXNE);
	
    // Enable USART 
    //OLD: USART_Cmd(USART2, ENABLE);
		if(HAL_UART_Init(&Uart4Handle) != HAL_OK)
		{
			Error_Handler();
		}
}


/** 
  * @brief  USART5 initialization function.
  * @note   Peripheral initialization is performed by ST block. Here RX and
  *          TX CircularBuffer are initialized, and USART interrupt are enabled.
  * @retval None.
  */
  

void USART5_Init()
{
    // Struct for GPIO and USART initialization
    GPIO_InitTypeDef GPIO_InitStruct;
    //USART_InitTypeDef USART_InitStruct;
  
    // USART_ClockInitTypeDef USART_ClockInitStruct;
    // NVIC_InitTypeDef NVIC_InitStruct;
  
  
#ifdef USART5_ON_PC12_PD2
    // Enable GPIOA clock
  __GPIOC_CLK_ENABLE();
  __GPIOD_CLK_ENABLE();
  __UART5_CLK_ENABLE();
  
    // Set USART TX pin (PC12)
    GPIO_InitStruct.Pin     = GPIO_PIN_12;
    GPIO_InitStruct.Mode    = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
    GPIO_InitStruct.Pull    = GPIO_NOPULL;
    GPIO_InitStruct.Alternate   = GPIO_AF8_UART5;
  
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);
  
    // Set USART RX in (PD2) with Pull-Up resistence on
    GPIO_InitStruct.Pin     = GPIO_PIN_2;
    GPIO_InitStruct.Pull    = GPIO_PULLUP;
  
    HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

#endif
    
    // USART clock enable
  __UART5_CLK_ENABLE();
  
  // Configure peripheral
  Uart5Handle.Instance    = UART5;
  Uart5Handle.Init.BaudRate = USART5_BAUD_RATE;
  Uart5Handle.Init.WordLength = UART_WORDLENGTH_8B;
  Uart5Handle.Init.StopBits = UART_STOPBITS_1;
  Uart5Handle.Init.Parity   = UART_PARITY_NONE;
  Uart5Handle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;
  Uart5Handle.Init.Mode   = UART_MODE_TX_RX;
    
    // RX and TX CircularBuffer initialization 
    CircularBuffer_Init(&USART5_TX_CB, USART5_TX_BUFF, USART_BUFFER_DIM);
    CircularBuffer_Init(&USART5_RX_CB, USART5_RX_BUFF, USART_BUFFER_DIM);
    
    // Enable USART3 RX interrupt
    HAL_NVIC_SetPriority(UART5_IRQn, 3, 0);
  HAL_NVIC_EnableIRQ(UART5_IRQn);
  
  //Enable the UART Transmit data register empty Interrupt
  //  => as soon as a byte is received the IRQ handler is called.
  //  DO NOT enable here the TXE interrupt, it will be enabled whne data is sent 
  //  and automatically disabled when data to be sent is finished (buffer empty)
    __HAL_UART_ENABLE_IT(&Uart5Handle, UART_IT_RXNE);
  
    // Enable USART 
    //OLD: USART_Cmd(USART2, ENABLE);
    if(HAL_UART_Init(&Uart5Handle) != HAL_OK)
    {
      Error_Handler();
    }
}



/* USARTx SEND/RECEIVE:                       *
*************************************************/

/** 
  * @brief  USART2 send function.
  * @param  data: uint8_t to send. 
  * @retval The function returns
  *          - 1: if data is correctly written into the TX CircularBuffer.
  *          - 0: otherwise.
  * @note   To allow data transmission, TX interrupt must be enabled when
  *          a new data is inserted into the TX CircularBuffer.
  */
uint8_t USART2_Send(uint8_t data)
{
    if(CircularBuffer_Write(&USART2_TX_CB, data))
    {
			  /* Enable the UART Data Register not empty Interrupt */
				__HAL_UART_ENABLE_IT(&Uart2Handle, UART_IT_TXE);
        return 1;
    }
    else
        return 0;
}

/** 
  * @brief  USART3 send function.
  * @param  data: uint8_t to send. 
  * @retval The function returns
  *          - 1: if data is correctly written into the TX CircularBuffer.
  *          - 0: otherwise.
  * @note   To allow data transmission, TX interrupt must be enabled when
  *          a new data is inserted into the TX CircularBuffer.
  */
uint8_t USART3_Send(uint8_t data)
{
    if(CircularBuffer_Write(&USART3_TX_CB, data))
    {
			  /* Enable the UART Data Register not empty Interrupt */
				__HAL_UART_ENABLE_IT(&Uart3Handle, UART_IT_TXE);
        return 1;
    }
    else
        return 0;
}


/** 
  * @brief  USART4 send function.
  * @param  data: uint8_t to send. 
  * @retval The function returns
  *          - 1: if data is correctly written into the TX CircularBuffer.
  *          - 0: otherwise.
  * @note   To allow data transmission, TX interrupt must be enabled when
  *          a new data is inserted into the TX CircularBuffer.
  */
uint8_t USART4_Send(uint8_t data)
{
    if(CircularBuffer_Write(&USART4_TX_CB, data))
    {
        /* Enable the UART Data Register not empty Interrupt */
        __HAL_UART_ENABLE_IT(&Uart4Handle, UART_IT_TXE);
        return 1;
    }
    else
        return 0;
}

/** 
  * @brief  USART5 send function.
  * @param  data: uint8_t to send. 
  * @retval The function returns
  *          - 1: if data is correctly written into the TX CircularBuffer.
  *          - 0: otherwise.
  * @note   To allow data transmission, TX interrupt must be enabled when
  *          a new data is inserted into the TX CircularBuffer.
  */
uint8_t USART5_Send(uint8_t data)
{
    if(CircularBuffer_Write(&USART5_TX_CB, data))
    {
        /* Enable the UART Data Register not empty Interrupt */
        __HAL_UART_ENABLE_IT(&Uart5Handle, UART_IT_TXE);
        return 1;
    }
    else
        return 0;
}


/** 
  * @brief  USART2 receive function.
  * @param  data: pointer to the memory area where the data will be stored. 
  * @retval The function returns
  *          - 1: if a data is correctly read from the receive CircularBuffer;
  *          - 0: otherwise.
  */
uint8_t USART2_Receive(uint8_t* data)
{
    return CircularBuffer_Read(&USART2_RX_CB, data);
}

/** 
  * @brief  USART3 receive function.
  * @param  data: pointer to the memory area where the data will be stored. 
  * @retval The function returns
  *          - 1: if a data is correctly read from the receive CircularBuffer;
  *          - 0: otherwise.
  */
uint8_t USART3_Receive(uint8_t* data)
{
    return CircularBuffer_Read(&USART3_RX_CB, data);
}

/** 
  * @brief  USART4 receive function.
  * @param  data: pointer to the memory area where the data will be stored. 
  * @retval The function returns
  *          - 1: if a data is correctly read from the receive CircularBuffer;
  *          - 0: otherwise.
  */
  
uint8_t USART4_Receive(uint8_t* data)
{
    return CircularBuffer_Read(&USART4_RX_CB, data);
}


/** 
  * @brief  USART5 receive function.
  * @param  data: pointer to the memory area where the data will be stored. 
  * @retval The function returns
  *          - 1: if a data is correctly read from the receive CircularBuffer;
  *          - 0: otherwise.
  */
  
uint8_t USART5_Receive(uint8_t* data)
{
    return CircularBuffer_Read(&USART5_RX_CB, data);
}


void Error_Handler(void)
{
	SetLed(GPIO_PIN_14,1); //Error Led. (Red?)
  while(1);
}
